#ifndef WORDS_H
#define WORDS_H
#include <string>


const std::string units[3][10]{
		{ "", "один ", "два ", "три ", "четыре ", "п€ть ", "шесть ", "семь ", "восемь ", "дев€ть " }, // единицы
		{ "", "", "двадцать ", "тридцать ", "сорок ", "п€тьдес€т ", "шестьдес€т ", "семьдес€т ", "восемьдес€т ", "дев€носто " }, // дес€тки
		{ "", "сто ", "двести ", "триста ", "четыреста ", "п€тьсот ", "шестьсот ", "семьсот ", "восемьсот ", "дев€тьсот " }  // сотни
};

const std::string handleTeens[10]{ "дес€ть ", "одиннадцать ", "двенадцать ", "тринадцать ","четырнадцать ", "п€тнадцать ",
									"шестьнадцать ", "семнадцать ", "восемьнадцать ","дев€тднадцать " };


const std::string millions[10]{ "миллионов ","миллион ","миллиона ", "миллиона ", "миллиона ",
									"миллионов ","миллионов ","миллионов" ,"миллионов ", "миллионов " };


const std::string thousands[10]{ "тыс€ч ", "тыс€ча ", "тыс€чи ", "тыс€чи ", "тыс€чи ",
									"тыс€ч ", "тыс€ч ", "тыс€ч ","тыс€ч ", "тыс€ч " };

const std::string unitThousands[10]{ "", "одна ", "две ", "три ", "четыре ",
									"п€ть ", "шесть ", "семь ","восемь ", "дев€ть " };


const std::string rubles[10]{ "рублей","рубль","рубл€","рубл€","рубл€",
								"рублей","рублей","рублей","рублей","рублей" };

const std::string tenMillions{ "миллионов " };

const std::string tenThousand{ "тыс€ч " };

const std::string tenRubles{ "рублей" };

#endif
