#ifndef WORDS_H
#define WORDS_H
#include <string>


const std::string numberWords[5][10]
{
		{"дес€ть ", "одиннадцать ", "двенадцать ", "тринадцать ","четырнадцать ", "п€тнадцать ",
		"шестьнадцать ", "семнадцать ", "восемьнадцать ","дев€тднадцать "},
		{ "", "один ", "два ", "три ", "четыре ", "п€ть ", "шесть ", "семь ", "восемь ", "дев€ть ",},
		{ "", "", "двадцать ", "тридцать ", "сорок ", "п€тьдес€т ", "шестьдес€т ", "семьдес€т ", "восемьдес€т ", "дев€носто " },
		{ "", "сто ", "двести ", "триста ", "четыреста ", "п€тьсот ", "шестьсот ", "семьсот ", "восемьсот ", "дев€тьсот " },
		{ "","одна ","две ","три ","четыре ","п€ть ","шесть ","семь ","восемь ","дев€ть " },
		
};

const std::string currencyForms[3][10]
{
	{ "рублей", "рубль", "рубл€", "рубл€", "рубл€",
	  "рублей", "рублей", "рублей", "рублей", "рублей" },

	  { "тыс€ч ", "тыс€ча ", "тыс€чи ", "тыс€чи ", "тыс€чи ",
	  "тыс€ч ", "тыс€ч ", "тыс€ч ", "тыс€ч ", "тыс€ч " },

	{ "миллионов ", "миллион ", "миллиона ", "миллиона ", "миллиона ",
	  "миллионов ", "миллионов ", "миллионов ", "миллионов ", "миллионов " },
};


const std::string currencyUnitsPlural[3]{ "рублей ","тыс€ч ","миллионов " };

#endif
